Tekla Open API Reference for Tekla Structures 2025
ModelObject.GetDoubleUserProperties Method
 Retrieves all double properties for the model object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetDoubleUserProperties(
	ref Hashtable values
)
Public Function GetDoubleUserProperties (
	ByRef values As Hashtable
) As Boolean
Parameters
values
Type: System.Collections.Hashtable
The return value, a hash table that contains all the values that were retrieved successfully.
Return Value
Type: Boolean
True if at least one single property was retrieved successfully.
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace